Repository: pmarquesmota/website
Catalog: start/1.16/po/*.po
Languages: fr

source: en
fr: fr

source: The Battle for Wesnoth 1.16
fr: La Bataille pour Wesnoth 1.16

source: <span id="branding-sub">Dune Conquests Update</span>
fr: <span id="branding-sub">Mise à jour Dune Conquests</span>

source: <i>October 2021.</i> The development team is proud to present version 1.16 of <cite><a href="/">The&nbsp;Battle&nbsp;for&nbsp;Wesnoth</a></cite>!
fr: <i>Octobre 2021.</i> L'équipe de développement est fière de présenter la version 1.16 de <cite><a href="/">La &nbsp;Bataille&nbsp;pour&nbsp;Wesnoth</a></cite>&nbsp;!

source: This release features a variety of improvements to many areas of the game including many improved campaigns, a fully rebalanced Dunefolk faction, new portraits and units, upgrades to the AI, a variety of new features for add-on authors, many <b>many</b> bugs fixed, and much more besides. Try out the new features for yourself, or take a look <a href="#game">below</a> for more details.
fr: Cette version contient de nombreuses améliorations sur de nombreux aspects du jeu, notamment des campagnes améliorées, la faction Ammorite entièrement rééquilibrée, une mise à jour de l'IA, une foule de nouvelle fonctionnalité pour les auteurs d'extensions, beaucoup <b>beaucoup</b> de bogues corrigés et bien plus encore. Essayez ces nouvelles fonctionnalités vous-même ou jetez un œil <a href="#game">plus bas</a> pour plus de détails.

source: <a class="download-button" role="button" href="https://www.wesnoth.org/#download"> <span class="download-arrow" aria-hidden="true"></span> <span class="download-text"> <span class="download-big">Download Now</span> </span> </a> <a class="itchio-button" role="button" href="https://wesnoth.itch.io/battle-for-wesnoth" aria-label="Available on itch.io"> <span class="download-text">
fr: <a class="download-button" role="button" href="https://www.wesnoth.org/#download"> <span class="download-arrow" aria-hidden="true"></span> <span class="download-text"> <span class="download-big">Télécharger maintenant</span> </span> </a> <a class="itchio-button" role="button" href="https://wesnoth.itch.io/battle-for-wesnoth" aria-label="Disponible sur itch.io"> <span class="download-text">

source: <span class="download-big">Get on itch.io</span> </span> </a> <a class="steam-button" role="button" href="https://store.steampowered.com/app/599390"> <span class="download-text"> <span class="steam-icon" aria-hidden="true"></span> <span class="download-big">Get on Steam</span> </span> </a>
fr: <span class="download-big">Obtenez le sur itch.io</span> </span> </a> <a class="steam-button" role="button" href="https://store.steampowered.com/app/599390"> <span class="download-text"> <span class="steam-icon" aria-hidden="true"></span> <span class="download-big">Obtenez le sur Steam</span> </span> </a>

source: What’s New in This Update
fr: Nouveautés de cette version

source: For Players
fr: Pour les joueurs

source: Dunefolk overhaul sample screenshot
fr: Visualisation des Ammorites

source: Due to our use of more modern distribution platforms such as Steam, itch.io, Flathub, and others, players will be automatically upgraded to a new stable series for the first time since <cite>Wesnoth</cite> was released. To support this, an option will be shown the first time 1.16.0 is started after being upgraded from 1.14.17. This will provide the option to migrate settings as well as download the 1.16 version of any add-ons that are installed, if they have been updated to work with 1.16. To go along with that, <cite>Wesnoth</cite> is now able to select save files from previous versions from within the game itself.
fr: Avec l'utilisation de plateformes modernes de distribution comme Steam, itch.io, Flathub et d'autres, les joueurs verront une mise à jour automatique vers la nouvelle version stable pour la première fois depuis la naissance de <cite>Wesnoth</cite>. Pour le gérer, un e option apparaitra la première fois que la version 1.16.0 sera lancée après avoir été mise à jour à partir de la version 1.14.17. Une option sera proposée pour migrer les réglages ainsi que télécharger la version 1.16 des toutes les extensions déjà installées, si elles ont été mises à jour pour fonctionner avec la version 1.16. Ainsi, <cite>Wesnoth</cite> est dorénavant capable de charger des sauvegardes de version précédentes à partir du jeu lui-même.

source: Addressing a long-standing pain point, especially for players with slow download speeds and/or data limits, updating add-ons will no longer result in the entire add-on being redownloaded — instead only the files that have actually changed will be downloaded, which will significantly reduce both the time it takes to update add-ons as well as how much data is used when updating. Additionally, any version of an add-on that has been recently uploaded by the author is selectable for download, thus allowing for downgrading an add-on if needed for any reason.
fr: Pour régler un sujet longuement attendu, en particulier par les joueurs avec des vitesses de téléchargement lentes ou des quotas, la mise à jour des extensions ne téléchargera plus les extensions entièrement. À la place, seuls les fichiers ayant réellement changé seront téléchargés, ce qui devrait réduire à la fois le temps et le volume de données lors des mises à jour. De plus, n'importe quelle version d'une extension, qui a été récemment envoyée par un auteur, est disponible au téléchargement, ainsi il est possible de redescendre de version si nécessaire.

source: Many aspects of the AI have seen improvements as well, with much of the experimental AI having been merged into the default AI. This allows it to better handle healers, poison, retreating, and other behavior.
fr: De nombreux aspects de l'IA ont été améliorés, la plupart de l'IA expérimentale ayant été fusionnée avec l'IA par défaut. Ainsi, elle gère mieux les soins, le poison, la fuite et d'autres comportement.

source: Finally, the entire Dunefolk faction has been reworked and rebalanced, including a reimagining of the unit lines, new unit descriptions and sprites, and reworking of the liminal alignment. They should now be much closer to the factions in the Default era in terms of overall strength as well as be more interesting to play.
fr: Finalement, la faction complète des Ammorites a été retravaillée et rééquilibrée, notamment de nouvelles images pour les unités, des nouvelles descriptions et un travail sur l'alignement liminal. Cette faction doit être très proche dorénavant des factions de l'aire par Défaut, en termes de force globale, devenant ainsi plus plaisante à jouer.

source: Campaigns
fr: Campagnes

source: Campaigns menu screenshot
fr: Photo d'écran du menu des campagnes

source: <cite>Descent into Darkness</cite>, <cite>Liberty</cite>, and <cite>Sceptre of Fire</cite> have received a multitude of revisions, including streamlining of the gameplay, addition of RPG elements, various storyline and dialogue rewrites, and visual and balance updates. For those looking for something befitting the upcoming night of Halloween, the overhauled, undead-heavy <cite>Descent into Darkness</cite> as well as the <cite>Secrets of the Ancients</cite> are the campaigns to play! <cite>Under the Burning Suns</cite> also received revamped maps and the Quenoth faction was rebalanced to better match the other mainline factions.
fr: <cite>Descent into Darkness</cite>, <cite>Liberté</cite>, et <cite>Le sceptre de feu</cite> ont reçu une multitude de révisions, notamment une fluidification du jeu, l'ajout d'éléments de RPG, des réécriture de dialogue et d'arc narratif, et des mises à jour du visuel et de l'équilibrage.

source: To accompany the improved AI that was added in this development cycle, all campaigns were adjusted to retain their intended difficulties and to prevent unusual difficulty spikes throughout the campaign, most notably in <cite>Eastern Invasion</cite>. The novice level campaigns were also reduced in difficulty to make them more accessible to newer players.
fr: En accompagnement de l'amélioration de l'IA, toutes les campagnes ont été ajustées pour garantir leur niveau de difficulté attendu et prévenir d'éventuels pics de difficulté à travers la campagne, notamment l'<cite>Invasion Orientale</cite>. Les campagnes de niveau novice ont une difficulté réduite pour les rendre plus accessible aux nouveaux joueurs.

source: <cite>The Hammer of Thursagan</cite> had several scenarios revised and others removed to modernize the story and gameplay, especially to focus more on dwarven culture and the interactions between their clans. <cite>Secrets of the Ancients</cite> also received a minor gameplay update with new zombie variations available for creation and recruiting.
fr: <cite>Le marteau de Thursagan</cite> a eu des scénarios revus et d'autres supprimés pour moderniser l'histoire et le jeu, notamment pour se concentrer sur la culture des nains et les interactions de leurs clans. <cite>Les Secrets des Anciens</cite> a reçu également des adaptations mineures de jeu, avec de nouvelles variations de zombies disponible à la création ou au recrutement.

source: Finally, accompanying the various modernizations and tweaks to many of the mainline campaigns, a new campaign menu was made featuring several stunning backgrounds drawn by Emilien Rotival (LordBob), Stefan, and Kathrin Polikeit (Kitty).
fr: Enfin, pour accompagner les nombreuses modernisations et améliorations des campagnes principale, un nouveau menu de campagne a été réalisé, arborant de magnifiques fonds dessinés par Emilien Rotival (LordBob), Stefan, et Kathrin Polikeit (Kitty).

source: Multiplayer
fr: Multijoueur

source: Isar's Cross background
fr: La croix de l'Isar

source: There have been two major additions to <cite>Wesnoth’s</cite> multiplayer content: Isle of Mists and World Conquest. Isle of Mists is a coop survival scenario in the vein of Dark Forecast, the latter of which has had its difficulty reduced with the former taking its place in terms of challenge. World Conquest, formerly the add-on World Conquest II, is a multiplayer campaign with RPG elements where up to three players can cooperate to survive, upgrade their units, and defeat the armies opposing them.
fr: Deux ajouts majeurs multijoueurs ont eu lieu : Isle of Mists et World Conquest. Isle of Mists est un scénario de survie coopératif dans la veine de Dark Forecast, celui-ci ayant sa difficulté réduite, tandis que le premier prend sa place en termes de challenge. World Conquest, anciennement l'extension World conquest II, est une campagne multijoueur avec des éléments de RPG, où jusqu’à trois joueurs peuvent coopérer pour survire, améliorer leurs unités et vaincre les armées adverses.

source: The add-on Plan Unit Advance is also now included in mainline. When enabled, this allows players to pre-emptively choose what they want their units to become if they level up on another player’s turn in multiplayer. Separately complementing this, units whose advancement has not been planned will now always level up into the same unit rather than choosing one at random when there are multiple options available.
fr: L'extension « planification de l'avancement » est dorénavant dans le jeu principal. Lorsqu'il est activé, ce mode permet aux joueurs de prévoir ce que leurs unités deviendront si elles ont un avancement lors du tour d'un autre joueur, en multijoueur. En complément, les unités qui ont de l'avancement sans planification, n'auront plus de choix aléatoire, mais le même avancement pour toutes lorsqu'il y a plusieurs choix.

source: This update also includes a large number of balance updates to the default era factions, especially gold and hitpoints tweaks to key units. Certain matchups and units should now be more balanced and allow for greater diversity in gameplay.
fr: De nombreux rééquilibrage des factions de l'ère par défaut ont eu lieu, notamment les pièces d'or et les points de vie concernant les unités clés. Certains combats et certaines unités devraient être mieux équilibrés dorénavant et permettre une plus grande diversité dans le jeu.

source: Another significant change is a new feature which isolates add-on content from each other once a game has started. This will prevent add-ons that are not being used in a game from interfering with each other, thereby significantly reducing the occurrence of strange bugs and out of sync errors.
fr: Un autre changement significatif est la nouvelle fonctionnalité qui isole le contenu d'une extension des autres lorsqu'une partie a commencé. Cela évite que les extensions qui ne sont pas utilisées dans une partie, interfèrent avec les autres, réduisant ainsi les bogues étranges et les erreurs de synchronisation.

source: Improvements for game hosts to better handle unwanted players have also been implemented — bans from individual games are now enforced by username rather than just by IP address, people on a player’s ignore list are now automatically banned from joining their games, and observers are now also required to enter the password to join password protected games rather than just players.
fr: Des améliorations pour les hôtes de jeu, afin de mieux gérer les joueurs non voulus, ont été implémentés. Les bannissements sont dorénavant réalisés par le nom d'utilisateur plutôt que par l'adresse IP, les personnes sur les « ignore list » d'un hôte ne peuvent plus rejoindre ces parties et les observateurs doivent également entrer un mot de passe pour rejoindre les parties protégées par mot de passe, à l'instar des joueurs.

source: For Content Creators
fr: Pour les créateurs de contenu

source: Royal Warrior portrait
fr: Portrait d'un guerrier royal

source: To go along with the new incremental downloads of add-on updates mentioned above, this release also includes incremental uploads for add-on authors; when uploading a new version of your add-on you will only send the files that have changed rather than the entire add-on. Additionally, add-ons can now provide translations of their titles and descriptions for multiple languages in the <code>_server.pbl</code> file. A minor security improvement has also been made to <code>_server.pbl</code> handling — it is no longer required for the passphrase field to be stored plaintext in the file; instead <cite>Wesnoth</cite> will prompt you to enter the passphrase if it is not present.
fr: Pour aller avec le téléchargement incrémental des extensions, cette version inclue également l'envoi incrémental pour les créateurs d'extensions. Seulement les fichiers qui auront changé seront envoyés. De plus, les extensions peuvent fournir des traductions pour leur titre et leur description dans le fichier <code>_server.pbl</code>. Une petite amélioration de la sécurité concernant le fichier <code>_server.pbl</code> a eu lieu : il n'est plus nécessaire de renseigner le mot de passe en clair dans le fichier ; à la place <cite>Wesnoth</cite> demandera le mot de passe s'il est absent.

source: More significantly, though perhaps less visible, are the various and sundry improvements made to the WML, Lua, and Wesnoth Formula Language (WFL) APIs. First and foremost, many of the existing Lua functions have been reorganized into submodules, and a comprehensive list of these changes can be found <a href="https://wiki.wesnoth.org/LuaAPI/UpdatingFrom14">here</a>. While the existing names of reorganized functions will still work, content authors are nevertheless encouraged to update existing code to the new modules. Separately, the version of Lua that comes packaged with <cite>Wesnoth</cite> has been updated to 5.4 from 5.3.
fr: Plus significativement, mais certainement moins visible, de nombreuses améliorations ont été réalisées sur WML, Lua et Wesnoth Formula Language (WFL) API. En premier et principalement, la plupart des fonctions Lua ont été réorganisées en sous-modules et une liste de tous ces changements est <a href="https://wiki.wesnoth.org/LuaAPI/UpdatingFrom14">disponible</a>. Bien que les noms des fonctions réorganisées existent toujours, les créateurs de contenus sont fortement encouragés à mettre à jour leur code vers les nouveaux modules. De façon annexe, la version de Lua fournie avec <cite>Wesnoth</cite> est passée de 5.3 à 5.4.

source: The <code>formula=</code> attribute is now also supported in the <code>[variable]</code> conditional tag. This allows the use of conditions that would otherwise require the use of more complex WML or Lua, as well as being generally a more concise way to express complex conditions.
fr: L'attribut <code>formula=</code> est maintenant pris en charge par le tag conditionnel <code>[variable]</code>. Cela permet d'utiliser des conditions qui auraient nécessité du WML ou Lua complexe, et permet une expression plus concise des conditions.

source: The <code>male_voice=</code> and <code>female_voice=</code> attributes are now supported in <code>[message]</code> to better allow for voice acting for add-ons.
fr: Les attributs <code>male_voice=</code> et <code>female_voice=</code> sont pris en charge dans <code>[message]</code> pour permettre de choisir les voix dans les extensions.

source: The new tag <code>[modify_unit_type]</code> has been added for campaigns, eras, and modifications to allow for changing certain unit types’ experience, cost, and advancement options. In particular, this is meant to be the replacement for the no longer supported <code>[advancefrom]</code> tag.
fr: Le nouveau tag <code>[modify_unit_type]</code> a été ajouté aux campagnes, ères et modifications pour permettre de changer l'expérience, le coût et l'avancement de certaines unités. En particulier, c'est un moyen de remplacer le tag <code>[advancefrom]</code>, qui n'est plus pris en charge.

source: Programmatically working with WML from within Lua has also been expanded and simplified with the addition of the <code>wml.merge</code>, <code>wml.diff</code>, <code>wml.patch</code>, <code>wml.find_child</code>, <code>wml.attribute_count</code>, <code>wml.equal</code>, <code>wml.valid</code>, and <code>wml.interpolate</code> functions.
fr: Travailler sur le WML à partir de Lua a été amélioré et simplifié, avec l'ajout des fonctions <code>wml.merge</code>, <code>wml.diff</code>, <code>wml.patch</code>, <code>wml.find_child</code>, <code>wml.attribute_count</code>, <code>wml.equal</code>, <code>wml.valid</code>, et <code>wml.interpolate</code>.

source: New terrain
fr: Nouveau terrain

source: A great deal of new art has been added to many different areas of the game. Portraits have been added for the Royal Warrior, Jinn, Naga Ophidian, Naga Ringcaster, and others. New terrains such as Catacombs, Ancient Stone floors and walls, and Overgrown Walls are now available for use in the editor, along with many improved terrain transitions. A variety of wildlife units have also been added, including the Crocodile, Cave Bear, Icemonax, Fire Ant, Horned Scarab, Seahorse, and more.
fr: Beaucoup de ressources graphiques nouvelles ont été ajouté dans le jeu. Les portraits des guerriers royaux des jinn, des Nagas ont été ajoutés. De nouveaux terrains comme les catacombes, les anciennes pierres pour les sols et les murs sont dorénavant disponibles dans l'éditeur, ainsi que des transitions de terrains améliorés. Une plus grande variété de faune et de flore a été ajoutée, notamment les crocodiles, les ours des cavernes, les fourmis de feu, le scarabée à corne, et plus encore.

source: Contribute
fr: Contribuer

source: <cite>The Battle for Wesnoth</cite> is constantly being improved and expanded upon by a multitude of international volunteers from diverse backgrounds. Since its inception in July 2003, hundreds of people have contributed to all areas of the game, from mainline content shipped as part of the official releases to hundreds of player-made projects available to download from our add-ons server. Whether you need help beating a particular scenario or adding a feature to your custom maps, <cite>Wesnoth</cite> boasts a massive community of players and creators always willing to help.
fr: <cite> La Bataille pour Wesnoth</cite> est constamment améliorée et enrichie par une multitude de bénévoles internationaux d'origines différentes. Depuis sa conception en juillet 2003, des centaines de personnes ont contribué à toutes les composantes de ce jeu, du contenu principal faisant partie des versions officielles jusqu'aux centaines de projets réalisés par les joueurs et disponibles sur nos serveurs d'extensions. Que vous ayez besoin d'aide sur un scénario ou d'ajouter une fonctionnalité sur une de vos cartes, <cite>Wesnoth</cite> dispose une grande communauté de joueurs et de créateur ne demandant qu'à vous aider.

source: Besides creating your own add-on content, there are many other ways you can help <cite>Wesnoth</cite>:
fr: Au delà de créer vos propres extensions, il y a de nombreuses façons d'aider <cite>Wesnoth</cite> :

source: <a href="https://wiki.wesnoth.org/Project">Contribute</a> code
fr: <a href="https://wiki.wesnoth.org/Project">Contribuer</a> au code

source: <a href="https://forums.wesnoth.org/viewforum.php?f=9">Create</a> art for the main game or for user-made <a href="https://forums.wesnoth.org/viewforum.php?f=23">add-ons</a>
fr: <a href="https://forums.wesnoth.org/viewforum.php?f=9">Créer</a> des ressources artistiques pour le jeu principal ou ses <a href="https://forums.wesnoth.org/viewforum.php?f=23">extensions</a> faites par des joueurs

source: <a href="https://wiki.wesnoth.org/WesnothTranslations">Translate</a> the game into your language
fr: <a href="https://wiki.wesnoth.org/WesnothTranslations">Traduire</a> le jeu dans votre langue

source: <a href="https://forums.wesnoth.org/viewforum.php?f=14">Produce</a> new music tracks and sound effects
fr: <a href="https://forums.wesnoth.org/viewforum.php?f=14">Produire</a> de nouvelles musiques et effets sonores

source: Spread the word about <cite>Wesnoth</cite> on social media!
fr: Parlez de <cite>Wesnoth</cite> sur les réseaux sociaux !

source: More Info
fr: Informations complémentaire

source: <a href="https://changelog.wesnoth.org/1.16/">Full Changelog</a> (English only)
fr: <a href="https://changelog.wesnoth.org/1.16/">Historique complet des modifications</a> (en anglais, très long)

source: <a href="https://www.wesnoth.org/manual/1.16/manual.en.html">User’s Manual</a>
fr: <a href="https://www.wesnoth.org/manual/1.16/manual.fr.html">Manuel utilisateur</a>

source: <a href="https://www.wesnoth.org">Official Website</a> (English only)
fr: <a href="https://www.wesnoth.org">Site officiel de Wesnoth</a> (en anglais)

source: <a href="https://www.wesnoth.org/start/1.14">Wesnoth 1.14 Release Notes</a>
fr: <a href="https//www.wesnoth.org/start/1.14">Notes de publication de Wesnoth 1.14</a>

source: <a href="https://www.wesnoth.org/start/1.12">Wesnoth 1.12 Release Notes</a>
fr: <a href="https//www.wesnoth.org/start/1.12">Notes de publication de Wesnoth 1.12</a>

source: <a href="https://www.wesnoth.org/start/1.10">Wesnoth 1.10 Release Notes</a>
fr: <a href="https//www.wesnoth.org/start/1.10">Notes de publication de Wesnoth 1.10</a>

source: <a href="https://www.wesnoth.org/start/1.8">Wesnoth 1.8 Release Notes</a>
fr: <a href="https//www.wesnoth.org/start/1.8">Notes de publication de Wesnoth 1.8</a>

source: <a href="https://www.wesnoth.org/start/1.6">Wesnoth 1.6 Release Notes</a>
fr: <a href="https//www.wesnoth.org/start/1.6">Notes de publication de Wesnoth 1.6</a>

source: This page is also available in the following languages:
fr: Cette page est également disponible dans les langues suivantes :

source: <a href="https://wiki.wesnoth.org/StartingPoints">Site Map</a> &#8226; <a href="https://status.wesnoth.org/">Site Status</a>
fr: <a href="https://wiki.wesnoth.org/StartingPoints">Plan du site</a> &#8226; <a href="https://status.wesnoth.org/">Statut de site</a>
